# Panda??
- 자료구조중 하나 입니다.
- series, Data Frame
- 빅데이터 분석에 있어 가장 좋은 성능을 보여주는 친구입니다.
    * 정의 : **pd.Series([4, 7, -2, 1])**
    * 값은 변경이 불가능, 대신 인덱스의 값을 바꿀수 있습니다.
    * 인덱스를 바꾸는 방법 : **변수이름.index = (['a','b','c','d'])**
    * Series의 자료형을 확인 하는 방법 : **변수이름.dtypes**
    * Series의 이름을 설정하는 방법 : **변수이름.name = '넣을 이름'**
    * Series의 인덱스의 이름을 설정하는 방법 : **변수이름.index.name = '넣을 이름'**

#### Data Frame
- 들어갈 데이터를 정의해 줘야 하는데, dictionary, array로 정의를 할 수 있습니다.
    * 정의 방법 : **data = {'name': ['홍길동','제갈량','임꺽정'], 'year' : [1542, 203, 1739]}**
    * 사용 방법 : **temp = pd.DataFrame(변수이름)**
    * 인덱스를 검사 : *temp.index (행방향 인덱스) temp.columns(열방향 인덱스)**
    * 값 확인방법 : **temp.values**
    * 각 인덱스의 이름 설정 : **temp.index.name = '', temp.columns.name = ''**
    * columns과 index의 설정을 바꾸는 방법 : **temp.columns=['','',''], temp.index=['','','']**

In [7]:
import pandas as pd

In [8]:
data = pd.Series([10, 7, -9, 2])

In [9]:
data.values # 시리즈의 값만 확인하는 방법

array([10,  7, -9,  2], dtype=int64)

In [10]:
data.index # 시리즈의 인덱스만 확인하는 방법

RangeIndex(start=0, stop=4, step=1)

In [11]:
data.dtypes

dtype('int64')

In [12]:
data.index = ['A', 'B', 'C', 'D']
data

A    10
B     7
C    -9
D     2
dtype: int64

In [13]:
data.name = "Score"
data.index.name = "Scorer"

In [14]:
data

Scorer
A    10
B     7
C    -9
D     2
Name: Score, dtype: int64

In [15]:
data = {'name': ['Hong','Je','Lim'], 'year' : [1542, 203, 1739]}
data

{'name': ['Hong', 'Je', 'Lim'], 'year': [1542, 203, 1739]}

In [16]:
data1 = pd.DataFrame(data)
data1

   name  year
0  Hong  1542
1    Je   203
2   Lim  1739

In [17]:
data1.index

RangeIndex(start=0, stop=3, step=1)

In [18]:
data1.columns

Index(['name', 'year'], dtype='object')

In [19]:
data1.values

array([['Hong', 1542],
       ['Je', 203],
       ['Lim', 1739]], dtype=object)

In [20]:
data1.columns.name = '정보'
data1.index.name = '이름'
data1

정보  name  year
이름
0   Hong  1542
1     Je   203
2    Lim  1739

In [21]:
data2 = pd.DataFrame(data, columns=['name','year','???'], index=['1번','2번','3번'])
data2

    name  year  ???
1번  Hong  1542  NaN
2번    Je   203  NaN
3번   Lim  1739  NaN

In [22]:
data1.describe()

정보            year
count     3.000000
mean   1161.333333
std     835.765717
min     203.000000
25%     872.500000
50%    1542.000000
75%    1640.500000
max    1739.000000

In [23]:
# MVP 선수를 표로 제작합니다.
# 2015 ~ 2019년도까지 최고의 선수를 입력해주면됩니다.
# 연도, 이름, 득점수, 경고횟수
# ex) 2015, 메시, 39, 0

In [24]:
score = pd.Series([1.0, 4.0, 5.0], index=['1번','2번','3번'])
data2['score'] = score
del data2['???']
data2

    name  year  score
1번  Hong  1542    1.0
2번    Je   203    4.0
3번   Lim  1739    5.0

In [26]:
# DataFrame에서 행 선택 후 조작
data2[0:3]

    name  year  score
1번  Hong  1542    1.0
2번    Je   203    4.0
3번   Lim  1739    5.0

In [27]:
data2["1번":"2번"] # 쓰지마세요.

    name  year  score
1번  Hong  1542    1.0
2번    Je   203    4.0

In [28]:
#loc -> Series형태로 반환을 합니다.
data2.loc["1번"]

name     Hong
year     1542
score       1
Name: 1번, dtype: object

In [29]:
data2.loc["2번":"3번"]

   name  year  score
2번   Je   203    4.0
3번  Lim  1739    5.0

In [30]:
data2.loc["2번":"3번", "score"]

2번    4.0
3번    5.0
Name: score, dtype: float64

In [31]:
data2.loc['4번',:] = ["Yu", 213, 4.5]

In [32]:
data2

    name    year  score
1번  Hong  1542.0    1.0
2번    Je   203.0    4.0
3번   Lim  1739.0    5.0
4번    Yu   213.0    4.5

In [33]:
data2.iloc[3]

name      Yu
year     213
score    4.5
Name: 4번, dtype: object

In [35]:
data2.iloc[1:3, 0:2]

   name    year
2번   Je   203.0
3번  Lim  1739.0

In [39]:
data2.iloc[[0,1,3],[0,2]]

    name  score
1번  Hong    1.0
2번    Je    4.0
4번    Yu    4.5

In [40]:
data2.iloc[:, 1:3]

      year  score
1번  1542.0    1.0
2번   203.0    4.0
3번  1739.0    5.0
4번   213.0    4.5

In [41]:
data2.iloc[0,0]

'Hong'

In [42]:
data2

    name    year  score
1번  Hong  1542.0    1.0
2번    Je   203.0    4.0
3번   Lim  1739.0    5.0
4번    Yu   213.0    4.5

In [44]:
data2["year"] < 1500

1번    False
2번     True
3번    False
4번     True
Name: year, dtype: bool

In [45]:
data2.loc[data2['year']<1500, :]

   name   year  score
2번   Je  203.0    4.0
4번   Yu  213.0    4.5

In [ ]:
data2.loc[data2['name'] == '문자',['출력하고 싶은 문자열1', '출력하고싶은문자열2']]

In [46]:
data2.loc[(data2['year'] > 200)&(data2['year'] < 1600), :]

    name    year  score
1번  Hong  1542.0    1.0
2번    Je   203.0    4.0
4번    Yu   213.0    4.5

In [48]:
import numpy as np
df = pd.DataFrame(np.random.rand(6,4))
df

          0         1         2         3
0  0.643123  0.352387  0.161936  0.791690
1  0.694913  0.519758  0.753110  0.569771
2  0.618793  0.944625  0.491052  0.815359
3  0.179832  0.745962  0.355189  0.173007
4  0.906762  0.985745  0.095634  0.476084
5  0.889829  0.645577  0.324839  0.234499

In [50]:
# date_range함수 -> datetime자료형 -> 날짜와 시간등을 알 수 있는 자료형
df.index = pd.date_range('20200422', periods=6)
df.index

DatetimeIndex(['2020-04-22', '2020-04-23', '2020-04-24', '2020-04-25',
               '2020-04-26', '2020-04-27'],
              dtype='datetime64[ns]', freq='D')

In [51]:
df

                   0         1         2         3
2020-04-22  0.643123  0.352387  0.161936  0.791690
2020-04-23  0.694913  0.519758  0.753110  0.569771
2020-04-24  0.618793  0.944625  0.491052  0.815359
2020-04-25  0.179832  0.745962  0.355189  0.173007
2020-04-26  0.906762  0.985745  0.095634  0.476084
2020-04-27  0.889829  0.645577  0.324839  0.234499

In [52]:
df.columns = ['A','B','C','D']

In [53]:
df

                   A         B         C         D
2020-04-22  0.643123  0.352387  0.161936  0.791690
2020-04-23  0.694913  0.519758  0.753110  0.569771
2020-04-24  0.618793  0.944625  0.491052  0.815359
2020-04-25  0.179832  0.745962  0.355189  0.173007
2020-04-26  0.906762  0.985745  0.095634  0.476084
2020-04-27  0.889829  0.645577  0.324839  0.234499

In [54]:
df['F'] = [1.0, 0.2, 0.4, np.nan, 6.1, 10.0]

In [57]:
df

                   A         B         C         D     F
2020-04-22  0.643123  0.352387  0.161936  0.791690   1.0
2020-04-23  0.694913  0.519758  0.753110  0.569771   0.2
2020-04-24  0.618793  0.944625  0.491052  0.815359   0.4
2020-04-25  0.179832  0.745962  0.355189  0.173007   NaN
2020-04-26  0.906762  0.985745  0.095634  0.476084   6.1
2020-04-27  0.889829  0.645577  0.324839  0.234499  10.0

In [58]:
#how=any : 행의 값중에 하나라도 nan일 경우 그 행을 없앤다.
#how=all : 행의 모든 값이 nan일 경우 그 행을 없앤다.
df.dropna(how='all')

                   A         B         C         D     F
2020-04-22  0.643123  0.352387  0.161936  0.791690   1.0
2020-04-23  0.694913  0.519758  0.753110  0.569771   0.2
2020-04-24  0.618793  0.944625  0.491052  0.815359   0.4
2020-04-25  0.179832  0.745962  0.355189  0.173007   NaN
2020-04-26  0.906762  0.985745  0.095634  0.476084   6.1
2020-04-27  0.889829  0.645577  0.324839  0.234499  10.0

In [59]:
df.fillna(value=3.2)

                   A         B         C         D     F
2020-04-22  0.643123  0.352387  0.161936  0.791690   1.0
2020-04-23  0.694913  0.519758  0.753110  0.569771   0.2
2020-04-24  0.618793  0.944625  0.491052  0.815359   0.4
2020-04-25  0.179832  0.745962  0.355189  0.173007   3.2
2020-04-26  0.906762  0.985745  0.095634  0.476084   6.1
2020-04-27  0.889829  0.645577  0.324839  0.234499  10.0

In [60]:
#nan값인지 확인하는 방법 : 변수이름.isnull()
df.isnull()

                A      B      C      D      F
2020-04-22  False  False  False  False  False
2020-04-23  False  False  False  False  False
2020-04-24  False  False  False  False  False
2020-04-25  False  False  False  False   True
2020-04-26  False  False  False  False  False
2020-04-27  False  False  False  False  False

In [61]:
df.loc[df.isnull()['F'], :]

                   A         B         C         D   F
2020-04-25  0.179832  0.745962  0.355189  0.173007 NaN

In [62]:
df.drop(pd.to_datetime('20200422'))

                   A         B         C         D     F
2020-04-23  0.694913  0.519758  0.753110  0.569771   0.2
2020-04-24  0.618793  0.944625  0.491052  0.815359   0.4
2020-04-25  0.179832  0.745962  0.355189  0.173007   NaN
2020-04-26  0.906762  0.985745  0.095634  0.476084   6.1
2020-04-27  0.889829  0.645577  0.324839  0.234499  10.0

In [65]:
df.drop([pd.to_datetime('20200422'), pd.to_datetime('20200426')])

                   A         B         C         D     F
2020-04-23  0.694913  0.519758  0.753110  0.569771   0.2
2020-04-24  0.618793  0.944625  0.491052  0.815359   0.4
2020-04-25  0.179832  0.745962  0.355189  0.173007   NaN
2020-04-27  0.889829  0.645577  0.324839  0.234499  10.0

In [66]:
data = [[1.4, np.nan],
       [8.2, -2.8],
       [np.nan, 3.2],
       [0.4, -0.4]]
df = pd.DataFrame(data, columns=["one","two"], index=['1','2','3','4'])

In [67]:
df

   one  two
1  1.4  NaN
2  8.2 -2.8
3  NaN  3.2
4  0.4 -0.4

In [68]:
df.sum(axis=0)# 행방향의 합

one    1.000000e+01
two    3.330669e-16
dtype: float64

In [69]:
df.sum(axis=1) # 열방향의 합

1    1.4
2    5.4
3    3.2
4    0.0
dtype: float64

In [70]:
df.sum(axis=1, skipna=False)

1    NaN
2    5.4
3    NaN
4    0.0
dtype: float64

In [72]:
df.loc['2'].sum()

5.3999999999999995

In [73]:
df['one'].sum()

10.0